# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [24]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [25]:
def run_queries(query):
    cur.execute(query)
    df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
    df.columns = [i[0] for i in cur.description]
    return df.head()

In [26]:
run_queries('''SELECT e.firstName, e.lastName FROM employees e
                JOIN offices o ON e.officeCode = o.officeCode
                WHERE o.city = 'Boston';''')

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [30]:
#Your code here
run_queries('''SELECT count(e.employeeNumber), o.city FROM employees e
                JOIN offices o ON e.officeCode = o.officeCode
                GROUP BY o.city; ''')

   count(e.employeeNumber)           city
0                        2         Boston
1                        2         London
2                        2            NYC
3                        5          Paris
4                        6  San Francisco

## Write 3 Questions of your own and answer them

In [22]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [34]:
# Your code here

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!